[
  {
    "id": "P-1726602001-123",
    "name": "طقم دواسات جلد فاخر",
    "image_desc": "صورة طقم دواسات من الجلد الطبيعي الأسود مع خياطة حمراء أنيقة",
    "short_desc": "طقم دواسات من الجلد الطبيعي عالي الجودة",
    "long_desc": "طقم دواسات مصنوع من أجود أنواع الجلد الطبيعي، يتميز بالراحة والأناقة. مناسب لجميع أنواع السيارات ويضيف لمسة فاخرة للمقصورة الداخلية. يتضمن الطقم 3 دواسات (فرامل، بنزين، دبرياج للسيارات المانيوال) مع براغي التثبيت.",
    "price": 299,
    "stock": 25,
    "category": "إكسسوارات داخلية",
    "tags": "جلد، دواسات، فاخر، راحة",
    "featured": true,
    "created_at": "2025-09-17T19:00:01.000Z"
  },
  {
    "id": "P-1726602002-456",
    "name": "مساند رأس مطرزة",
    "image_desc": "صورة مساند رأس مطرزة بخيوط ذهبية على قماش أسود فاخر",
    "short_desc": "مساند رأس مطرزة بتطريز يدوي فاخر",
    "long_desc": "مساند رأس مصنوعة من أجود أنواع الأقمشة مع تطريز يدوي فاخر بخيوط ذهبية. توفر الراحة والدعم للرقبة والرأس أثناء القيادة الطويلة. متوفرة بعدة تصاميم وألوان لتناسب ديكور سيارتك.",
    "price": 150,
    "stock": 40,
    "category": "إكسسوارات داخلية", 
    "tags": "مساند، تطريز، راحة، فاخر",
    "featured": false,
    "created_at": "2025-09-17T19:00:02.000Z"
  },
  {
    "id": "P-1726602003-789",
    "name": "أضواء LED داخلية ملونة",
    "image_desc": "صورة شريط أضواء LED ملونة تضيء مقصورة السيارة بألوان متدرجة من الأزرق إلى الأحمر",
    "short_desc": "شريط أضواء LED قابل للتحكم في الألوان عبر الهاتف",
    "long_desc": "شريط أضواء LED حديث يمكن التحكم فيه عن طريق تطبيق الهاتف المحمول عبر البلوتوث. يوفر إضاءة ملونة رائعة لمقصورة السيارة مع إمكانية اختيار من أكثر من 16 مليون لون. يتضمن ميزات الموسيقى التفاعلية والتحكم في السطوع.",
    "price": 199,
    "stock": 30,
    "category": "إضاءة",
    "tags": "LED، إضاءة، ألوان، تحكم، بلوتوث",
    "featured": true,
    "created_at": "2025-09-17T19:00:03.000Z"
  },
  {
    "id": "P-1726602004-012",
    "name": "كفرات مقود من الجلد الطبيعي",
    "image_desc": "صورة كفر مقود من الجلد البني الطبيعي مع خياطة متقنة وملمس ناعم",
    "short_desc": "كفر مقود من الجلد الطبيعي المدبوغ يدوياً",
    "long_desc": "كفر مقود مصنوع من الجلد الطبيعي المدبوغ يدوياً بعناية فائقة. يوفر قبضة محكمة ومريحة ويحمي المقود الأصلي من التآكل والخدوش. سهل التركيب ويأتي مع خيوط قوية للتثبيت. متوفر بألوان الأسود والبني والبيج.",
    "price": 89,
    "stock": 50,
    "category": "إكسسوارات داخلية",
    "tags": "مقود، جلد، حماية، راحة، قبضة",
    "featured": false,
    "created_at": "2025-09-17T19:00:04.000Z"
  },
  {
    "id": "P-1726602005-345",
    "name": "منظم حقيبة صندوق السيارة",
    "image_desc": "صورة منظم أسود متعدد الجيوب لترتيب أدوات صندوق السيارة مع مقابض محمولة",
    "short_desc": "منظم قابل للطي لصندوق السيارة مع عدة جيوب",
    "long_desc": "منظم عملي وقابل للطي مصنوع من قماش أكسفورد قوي ومقاوم للماء. يحتوي على جيوب متعددة بأحجام مختلفة لتنظيم أدوات السيارة والحقائب ومستلزمات الطوارئ. يمكن طيه لتوفير المساحة عند عدم الاستخدام. يتضمن أحزمة تثبيت قابلة للتعديل.",
    "price": 125,
    "stock": 20,
    "category": "إكسسوارات خارجية",
    "tags": "تنظيم، صندوق، طي، عملي، تخزين",
    "featured": false,
    "created_at": "2025-09-17T19:00:05.000Z"
  }
]